---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RoomComputationMethod
source: html/a8050896-ec42-dafe-a95b-e324614bb8ca.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RoomComputationMethod Property

"Computation"

## Syntax (C#)
```csharp
public static ForgeTypeId RoomComputationMethod { get; }
```